# 给定一个包含 n 个整数的数组 nums，判断 nums 中是否存在三个元素 a，b，c ，使得 a + b + c = 0 ？找出所有满足条件且不重复的三元组。
#
# 注意：答案中不可以包含重复的三元组。
#
# 例如, 给定数组 nums = [-1, 0, 1, 2, -1, -4]，
#
# 满足要求的三元组集合为：
# [
#   [-1, 0, 1],
#   [-1, -1, 2]
# ]
#

# nums = [-1, 0, 1, 2, -1, -4]
# tmp = 0, 1, 2, -1, -4  找两个和为1
# tmp2 = 1,2,-1,-4 找一个数等于-num-tmp[i]

class Solution:
    # 超时
    def threeSum(self, nums: [int]) -> [[int]]:
        result = []
        nums.sort()
        tmp = nums.copy()

        for num in nums:
            if num <= 0:
                tmp.pop(tmp.index(num))
                for i in range(len(tmp)):
                    tmp2 = tmp.copy()
                    tmp2.pop(tmp2.index(tmp[i]))
                    for j in range(len(tmp2)):
                        if tmp2[j] == -num - tmp[i]:
                            child_res = [num, tmp2[j], tmp[i]]
                            child_res.sort()
                            if child_res not in result:
                                result.append(child_res)
                                break
                            else:
                                continue


            tmp = nums.copy()

        return result


if __name__ == '__main__':
    sol = Solution()
    s = [-4, -8, 7, 13, 10, 1, -14, -13, 0, 8, 6, -13, -5, -4, -12, 2, -11, 7, -5, 0, -9, -14, -8, -9, 2, -7, -13, -3,
         13, 9, -14, -6, 8, 1, 14, -5, -13, 8, -10, -5, 1, 11, -11, 3, 14, -8, -10, -12, 6, -8, -5, 13, -15, 2, 11, -5,
         10, 6, -1, 1, 0, 0, 2, -7, 8, -6, 3, 3, -13, 8, 5, -5, -3, 9, 5, -4, -14, 11, -8, 7, 10, -6, -3, 11, 12, -14,
         -9, -1, 7, 5, -15, 14, 12, -5, -8, -2, 4, 2, -14, -2, -12, 6, 8, 0, 0, -2, 3, -7, -14, 2, 7, 12, 12, 12, 0, 9,
         13, -2, -15, -3, 10, -14, -4, 7, -12, 3, -10]
    s2 = [-2, 10, -14, 11, 5, -4, 2, 0, -10, -10, 5, 7, -11, 10, -2, -5, 2, 12, -5, 14, -11, -15, -5, 12, 0, 13, 8, 7,
          10, 6, -9, -15, 1, 14, 11, -9, -13, -10, 6, -8, -5, -11, 6, -9, 14, 11, -7, -6, 8, 3, -7, 5, -5, 3, 2, 10, -6,
          -12, 3, 11, 1, 1, 12, 10, -8, 0, 8, -5, 6, -8, -6, 8, -12, -14, 7, 9, 12, -15, -12, -2, -4, -4, -12, 6, 7, -3,
          -6, -14, -8, 4, 4, 9, -10, -7, -4, -3, 1, 11, -1, -8, -12, 9, 7, -9, 10, -1, -14, -1, -8, 11, 12, -5, -7]
    r1 = sol.threeSum(s)
    print(r1)
